{
    "job_experience": [
        {
            "company": "Ualá",
            "image_logo": "uala-logo.png",
            "position": "Backend Developer",
            "since": "February 2023",
            "until": "Present",
            "description": "Part of Platform team, Backend Developer contributing to development of solutions for projects within AWS platform. Use technologies like Java, Go, and Python, implementation of services like DynamoDB, Lambdas, API Gateway, Terraform, and GitHub Actions. Worked within microservices architecture framework, optimizing efficiency and scalability of systems."
        },
        {
            "company": "Ualá",
            "image_logo": "uala-logo.png",
            "position": "Data Platform Engineer",
            "since": "September 2021",
            "until": "February 2023",
            "description" : "Entered the Data Platform team at the company, involved in data migration, application development to facilitate pipeline assembly, and incident resolution. Applied methodologies and work methods, researching tools and technologies for the rest of the data area.Contributed to the creation of the data platform for internal users using Python and FastAPI for the backend, VueJS for the frontend, and technologies such as Docker, GCP, PostgreSQL, BigQuery, and Airflow"
        },
        {
            "company": "CoderHouse",
            "image_logo": "coderhouse-logo.png",
            "position": "Tutor",
            "since": "March 2022",
            "until": "July 2022",
            "description": "Worked as tutor for Coderhouse supporting courses in Python and Django."
        },
        {
            "company": "Ergo Renova",
            "image_logo": "ergo-logo.png",
            "position": "Data Engineer",
            "since": "January 2019",
            "until": "September 2021",
            "description" : "Worked as Data Enginner for Ergo Renova in the projects of Movistar, GIRE and Telecom Argentina.\nI worked building ETLs, developing APIs, processing data, ingestion of data and data mining."
        }
    ]
}