{
    "job_experience": [
        {
            "company": "Ualá",
            "image_logo": "uala-logo.png",
            "position": "Backend Developer",
            "since": "Febrero 2023",
            "until": "Presente",
            "description": "Formo parte del equipo de Platform como Desarrollador Backend, contribuyendo al desarrollo de soluciones para proyectos dentro en la plataforma de AWS. Utilizo tecnologías como Java, Go y Python, así como la implementación de servicios como DynamoDB, Lambdas, API Gateway, Terraform y Github Actions. He trabajado dentro del marco de arquitectura de microservicios que optimiza la eficiencia y la escalabilidad de los sistemas."
        },
        {
            "company": "Ualá",
            "image_logo": "uala-logo.png",
            "position": "Data Platform Engineer",
            "since": "Septiembre 2021",
            "until": "Febrero 2023",
            "description": "Proyecto de Plataforma de Datos en Google Cloud donde participo de la migración de datos, armado de aplicaciones para facilitar el armado de pipelines y solución de incidencias, aplicación de metodologías y formas de trabajo con investigación de herramientas y tecnologías para el resto del area de Datos.\nContribuí a la creación de la plataforma de datos para usuarios internos utilizando Python y FastAPI para el backend, VueJS para el frontend, y tecnologías como Docker, GCP, PostgreSQL, BigQuery y Airflow.\nDesde que ingrese al equipo se lograron que las soluciones y pipelines de datos sean un 50 % más rápidas que antes, y se implementó un método eficiente de trabajo con GitHub, Agile y software interno creado para mejor facilidad."
        },
        {
            "company": "CoderHouse",
            "image_logo": "coderhouse-logo.png",
            "position": "Tutor",
            "since": "Marzo 2022",
            "until": "Julio 2022",
            "description": "Trabaje en Coderhouse como tutor para los cursos de Python y Django de la empresa."
        },
        {
            "company": "Ergo Renova",
            "image_logo": "ergo-logo.png",
            "position": "Data Engineer",
            "since": "Enero 2019",
            "until": "Septiembre 2021",
            "description": "Me desempeñe como Data Engineer en proyectos de Data para Movistar, GIRE y Telecom Argentina realizando tareas de desarrollo de pipelines, APIs, ingestas, procesamiento y mineria de datos."
        }
    ]
}